

class Procudt{
  final String name, image, discription,size;
  final int id, prict;
  Procudt({required this.name,required this.image,required this.prict,required this.discription, required this.id, required this.size});
}

List<Procudt>products =[
  Procudt(
  id: 1,
  name: 'ນ້ຳດື່ມພຽວເຣ', 
  image: 'images/purer1.png',
  prict: 12000,
  size: 'ຂະໜາດ 20 L',
  discription: 'ນ້ຳດື່ມພຽວເລ່ ຂະໜາດ 20ລິດ ເປັນເຈົ້າແລກໃນລາວທີ່ໃຊ້ບັນຈຸພັນຊະນິດ PC ທີ່ມີຄຸນນະພາບ ນຳເຂົ້າຈາກຕ່າງປະເທດ ແລະ ຜະລິດໂດຍໃຊ້ເຄື່ອງຈັກທີ່ທັນສະໄໝ ໃນການ ລ້າງ, ບັນຈຸ, ອັດຝາ ໂດຍບໍ່ໄດ້ສຳພັດກັບຜະລິດຕະພັນ ແລະ ໄດ້ຮັບການຢັ້ງຢືນ ມາດຕະຖານ GMP'
  ),
  Procudt(
  id: 2,
  name: 'ນ້ຳດື່ມພຽວເຣ', 
  image: 'images/purer2.png',
  prict: 8000,
  size: 'ຂະໜາດ 12 L',
  discription: 'ນ້ຳດື່ມພຽວເລ່ ຂະໜາດ 20ລິດ ເປັນເຈົ້າແລກໃນລາວທີ່ໃຊ້ບັນຈຸພັນຊະນິດ PC ທີ່ມີຄຸນນະພາບ ນຳເຂົ້າຈາກຕ່າງປະເທດ ແລະ ຜະລິດໂດຍໃຊ້ເຄື່ອງຈັກທີ່ທັນສະໄໝ ໃນການ ລ້າງ, ບັນຈຸ, ອັດຝາ ໂດຍບໍ່ໄດ້ສຳພັດກັບຜະລິດຕະພັນ ແລະ ໄດ້ຮັບການຢັ້ງຢືນ ມາດຕະຖານ GMP'
  ),
  Procudt(
  id: 3,
  name: 'ນ້ຳດື່ມພຽວເຣ', 
  image: 'images/purer3.png',
  prict: 21000,
  size: 'ຂະໜາດ 600ml',
  discription: 'ນ້ຳດື່ມພຽວເລ່ ຂະໜາດ 20ລິດ ເປັນເຈົ້າແລກໃນລາວທີ່ໃຊ້ບັນຈຸພັນຊະນິດ PC ທີ່ມີຄຸນນະພາບ ນຳເຂົ້າຈາກຕ່າງປະເທດ ແລະ ຜະລິດໂດຍໃຊ້ເຄື່ອງຈັກທີ່ທັນສະໄໝ ໃນການ ລ້າງ, ບັນຈຸ, ອັດຝາ ໂດຍບໍ່ໄດ້ສຳພັດກັບຜະລິດຕະພັນ ແລະ ໄດ້ຮັບການຢັ້ງຢືນ ມາດຕະຖານ GMP'
  ),
  Procudt(
  id: 4,
  name: 'ນ້ຳດື່ມພຽວເຣ', 
  image: 'images/purer4.png',
  prict: 17000,
  size: 'ຂະໜາດ 330ml',
  discription: 'ນ້ຳດື່ມພຽວເລ່ ຂະໜາດ 20ລິດ ເປັນເຈົ້າແລກໃນລາວທີ່ໃຊ້ບັນຈຸພັນຊະນິດ PC ທີ່ມີຄຸນນະພາບ ນຳເຂົ້າຈາກຕ່າງປະເທດ ແລະ ຜະລິດໂດຍໃຊ້ເຄື່ອງຈັກທີ່ທັນສະໄໝ ໃນການ ລ້າງ, ບັນຈຸ, ອັດຝາ ໂດຍບໍ່ໄດ້ສຳພັດກັບຜະລິດຕະພັນ ແລະ ໄດ້ຮັບການຢັ້ງຢືນ ມາດຕະຖານ GMP'
  ),
];